from django.db import migrations

def load_contractor_mappings(apps, schema_editor):
    ExpenseCategory = apps.get_model('coin_desk', 'ExpenseCategory')
    ContractorExpenseMapping = apps.get_model('coin_desk', 'ContractorExpenseMapping')

    # Create mappings based on provided data
    mappings = [
        {"inn": "7735599256", "category": "Перевод между своими счетами", "description": "ООО СИЛЬВЕР"},
        {"inn": "7735184854", "category": "Перевод между своими счетами", "description": "ООО СИЛЬВЕР +"},
        {"inn": "7706092528", "category": "Комиссии банков и банковское обслуживание", "description": "ПАО Банк ФК Открытие"},
        {"inn": "7826156685", "category": "Расходы на доставку", "description": "ООО ДЕЛОВЫЕ ЛИНИИ"},
        {"inn": "7743051047", "category": "Расходы на покупку кулеров и комплектующих", "description": "ООО ЭКОСИСТЕМС"},
        {"inn": "9709113040", "category": "Аренда офиса", "description": "ООО КОМПИТ"},
        {"inn": "9709123680", "category": "Аренда офиса", "description": "ООО ЭМБРИМО"},
        {"inn": "7718620740", "category": "Поиск персонала", "description": "ООО Хэдхантер"},
        {"inn": "7714774806", "category": "Расходы на чистящие средства и инвентарь",
         "description": "ООО ФЛИТСЕРВИС Ко"},
        {"inn": "7701974131", "category": "Расходы на корпоративную связь", "description": "ООО Телемир"},
        {"inn": "7735179692", "category": "Вода для офиса", "description": "ООО ТД Город вод"},
        {"inn": "7840339881", "category": "Расходы на хостинг", "description": "ООО Таймвэб"},
        {"inn": "6316256049", "category": "Расходы на работу сайта", "description": "ООО Студия Автоматизации"},
        {"inn": "7743036465", "category": "Топливо для водителей", "description": "ООО ППР"},
        {"inn": "7709501144", "category": "Расходы на корпоративную связь", "description": "ООО Манго Телеком"},
        {"inn": "7721793895", "category": "Расходы на канцтовары", "description": "ООО Комус"},
        {"inn": "7703388936", "category": "Расходы на работу сайта", "description": "ООО Колтач Солюшнс"},
        {"inn": "7710668349", "category": "Поиск персонала", "description": "ООО Кех Екоммерц"},
        {"inn": "7720736728", "category": "Расходы на битрикс",
         "description": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ИНФОРМЮНИТИ"},
        {"inn": "5405998837", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ООО ИНТЕРТЕХНОЛОДЖИ"},
        {"inn": "7722753969", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "Баева Светлана Юрьевна"},
        {"inn": "7735094390", "category": "Расходы на ЭДО", "description": "ООО БЦ Профит"},
        {"inn": "7801451618", "category": "Расходы на хостинг", "description": "ООО Бегет"},
        {"inn": "5029191396", "category": "Расходы на покупку кулеров и комплектующих", "description": "ООО Акватик"},
        {"inn": "6165127095", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ООО АКВА МАРКЕТ"},
        {"inn": "7810704382", "category": "Расходы на рекламу", "description": "ООО Адв-Сервис"},
        {"inn": "2465282400", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ООО АБ Экомир-Красноярск"},
        {"inn": "5029094730", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ООО ТД ХОТФРОСТ"},
        {"inn": "7717613860", "category": "Расходы на покупку кулеров и комплектующих", "description": "ООО СОЛФЕРИНО"},
        {"inn": "7107507124", "category": "Расходы на работу сайта", "description": "ООО Рекламный Агрегатор"},
        {"inn": "7735534315", "category": "Расходы на чистящие средства и инвентарь",
         "description": "ООО ПРОМТОРГСЕРВИС"},
        {"inn": "9718075753", "category": "Расходы на рекламу", "description": "ООО Перформанс Платформа"},
        {"inn": "7722467502", "category": "Вода для офиса",
         "description": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ПЕРВЫЙ ИСТОЧНИК"},
        {"inn": "3528160946", "category": "Расходы на работу сайта", "description": "ООО Онлайн-Сервис"},
        {"inn": "9718067720", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ООО Литакватех"},
        {"inn": "7801451618", "category": "Расходы на хостинг", "description": "ООО Бегет"},
        {"inn": "2465282400", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ООО АБ Экомир-Красноярск"},
        {"inn": "27405626930", "category": "Расходы на почту, и другие расходы на документооборот", "description": ""},
        {"inn": "773573278277", "category": "Расходы на ККТ", "description": "ИП ПАНТЕЛЕЙМОНОВ РОМАН ЮРЬЕВИЧ"},
        {"inn": "773574079605", "category": "Перевод между своими счетами", "description": "Житников Юрий Сергеевич"},
        {"inn": "773509627178", "category": "Перевод между своими счетами",
         "description": "ИП Житников Сергей Евгеньевич"},
        {"inn": "230905247270", "category": "Выплата заработной платы", "description": "Бабич Татьяна Александровна"},
        {"inn": "7736520080", "category": "Расходы на электроэнергию для офиса", "description": "АО Мосэнергосбыт"},
        {"inn": "773575992504", "category": "Выплата заработной платы", "description": "Сотрудник"},
        {"inn": "9705120864", "category": "Комиссии банков и банковское обслуживание",
         "description": "АКЦИОНЕРНОЕ ОБЩЕСТВО ТОЧКА"},
        {"inn": "7722202993", "category": "Расходы на рекламу", "description": "АО Восток-Сервис-Спецкомплект"},
        {"inn": "9721194461", "category": "Комиссии банков и банковское обслуживание", "description": "ООО Банк Точка"},
        {"inn": "7716790560", "category": "Расходы на покупку кулеров и комплектующих", "description": "ООО АЕЛ"},
        {"inn": "773700284565", "category": "Аренда офиса", "description": "ИП Митрофанов Андрей Владимирович"},
        {"inn": "771873387940", "category": "Аренда офиса", "description": "ИП Петрова Ольга Александровна"},
        {"inn": "7727406020", "category": "Налоги", "description": "Казначейство России (ФНС России)"},
        {"inn": "7734610563", "category": "Расходы на корпоративную связь",
         "description": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ВАЗЗАП"},
        {"inn": "7743136501", "category": "Расходы на корпоративную связь", "description": "ООО Норбис"},
        {"inn": "7703363868", "category": "Налоги", "description": "ОСФР ПО Г. МОСКВЕ И МОСКОВСКОЙ ОБЛАСТИ"},
        {"inn": "7705031674", "category": "Не учитывается",
         "description": "Департамент городского Имущества Города Москвы"},
        {"inn": "7705031674", "category": "Не учитывается",
         "description": "Департамент городского Имущества Города Москвы"},
        {"inn": "7702070139", "category": "Не учитывается", "description": "Банк ВТБ (ПАО)"},
        {"inn": "7736207543", "category": "Расходы на рекламу", "description": "ООО Яндекс"},
        {"inn": "773580085808", "category": "Выплата заработной платы", "description": ""},
        {"inn": "502913402194", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "ИП Сухарев Константин Викторович"},
        {"inn": "7735509767", "category": "Расходы на рекламу", "description": "ООО Компания Резонанс"},
        {"inn": "7734622671", "category": "Расходы на ЭДО",
         "description": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ КОМАНДА МЕГАПЛАНА"},
        {"inn": "773572522010", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "Семин Александр Викторович"},
        {"inn": "7717107991", "category": "Расходы на ЭДО", "description": "ООО Крипто-Про"},
        {"inn": "230914142901", "category": "Выплата заработной платы",
         "description": "Крицкий Константин Александрович"},
        {"inn": "541075697830", "category": "Расходы на покупку кулеров и комплектующих",
         "description": "Цымбал Денис Владимирович"}
    ]

    for mapping in mappings:
        category, _ = ExpenseCategory.objects.get_or_create(name=mapping["category"])
        ContractorExpenseMapping.objects.get_or_create(
            inn=mapping["inn"],
            expense_category=category,
            description=mapping["description"]
        )


class Migration(migrations.Migration):
    dependencies = [
        ('coin_desk', '0005_alter_expensecategory_pl_entry'),
        ('coin_desk', '0004_contractorexpensemapping'),
        ('coin_desk', '0002_auto_20250616_2029'),
    ]

    operations = [
        migrations.RunPython(load_contractor_mappings),
    ]

